---
kind: method
id: M:Autodesk.Revit.ApplicationServices.Application.Dispose
source: html/100823e6-bcd6-68de-1735-21f329c28a20.htm
---
# Autodesk.Revit.ApplicationServices.Application.Dispose Method

Releases all resources used by the Application

## Syntax (C#)
```csharp
public void Dispose()
```